InformationRegisters/ПоставщикиУслугProRating.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>ПоставщикиУслугProRating</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Отключена</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Работаем</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОпытИспользования</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ОпытИспользования</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ТорговаяТочка</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктурныеЕдиницы</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Поставщик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыУслугProRating</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СоответствиеУслугТипамУслугProRating.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<InformationRegister>
		<Properties>
			<Name>СоответствиеУслугТипамУслугProRating</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ТипУслуги</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыУслугProRating</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Enums/ВидыНоменклатуры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.4">
	<Enum>
		<Properties>
			<Name>ВидыНоменклатуры</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Материал</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Товар</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Оборудование</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Услуга</Name>
					<Comment>(Общ)</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

InformationRegisters/ПоставщикиУслугProRating/Ext/ManagerModule.bsl
Процедура ОбновитьПоставщиковУслуг() Экспорт
	
	Запрос = Новый Запрос(
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ПоступлениеТоваровУслуг.Контрагент,
		|	ПоступлениеТоваровУслугУслуги.Номенклатура КАК Услуга,
		|	ВЫБОР
		|		КОГДА СпрСтруктурныеЕдиницы.НомерТочки = 0
		|			ТОГДА ЗНАЧЕНИЕ(Справочник.СтруктурныеЕдиницы.ПустаяСсылка)
		|		ИНАЧЕ ПоступлениеТоваровУслугУслуги.ТорговаяТочка
		|	КОНЕЦ КАК ТорговаяТочка
		|ПОМЕСТИТЬ ИнформацияПоУслугам
		|ИЗ
		|	Документ.ПоступлениеТоваровУслуг.Услуги КАК ПоступлениеТоваровУслугУслуги
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.ПоступлениеТоваровУслуг КАК ПоступлениеТоваровУслуг
		|		ПО ПоступлениеТоваровУслугУслуги.Ссылка = ПоступлениеТоваровУслуг.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.СтруктурныеЕдиницы КАК СпрСтруктурныеЕдиницы
		|		ПО ПоступлениеТоваровУслугУслуги.ТорговаяТочка = СпрСтруктурныеЕдиницы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК СпрНоменклатура
		|		ПО ПоступлениеТоваровУслугУслуги.Номенклатура = СпрНоменклатура.Ссылка
		|ГДЕ
		|	ПоступлениеТоваровУслуг.Дата МЕЖДУ &Дата1 И &Дата2
		|	И ПоступлениеТоваровУслуг.Проведен
		|	И СпрНоменклатура.ВидНоменклатуры = ЗНАЧЕНИЕ(Перечисление.ВидыНоменклатуры.Услуга)
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ИнформацияПоУслугам.ТорговаяТочка,
		|	ИнформацияПоУслугам.Контрагент КАК Поставщик,
		|	СоответствиеУслугТипамУслугProRating.ТипУслуги
		|ПОМЕСТИТЬ ВсеУслуги
		|ИЗ
		|	ИнформацияПоУслугам КАК ИнформацияПоУслугам
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.СоответствиеУслугТипамУслугProRating КАК СоответствиеУслугТипамУслугProRating
		|		ПО ИнформацияПоУслугам.Услуга = СоответствиеУслугТипамУслугProRating.Услуга
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|УНИЧТОЖИТЬ ИнформацияПоУслугам
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	ВсеУслуги.ТорговаяТочка,
		|	ВсеУслуги.Поставщик,
		|	ВсеУслуги.ТипУслуги,
		|	ИСТИНА КАК Работаем
		|ИЗ
		|	ВсеУслуги КАК ВсеУслуги
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПоставщикиУслугProRating КАК ПоставщикиУслугProRating
		|		ПО ВсеУслуги.ТорговаяТочка = ПоставщикиУслугProRating.ТорговаяТочка
		|			И ВсеУслуги.Поставщик = ПоставщикиУслугProRating.Поставщик
		|			И ВсеУслуги.ТипУслуги = ПоставщикиУслугProRating.ТипУслуги
		|ГДЕ
		|	ПоставщикиУслугProRating.Поставщик ЕСТЬ NULL");
	Запрос.УстановитьПараметр("Дата1", Дата("20180101"));
	Запрос.УстановитьПараметр("Дата2", КонецМесяца(ТекущаяДата()));
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда Возврат; КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ПоставщикиУслугProRating.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(РезультатЗапроса.Выгрузить());
	НаборЗаписей.Записать(Ложь);
	
КонецПроцедуры
